<?php

return 
[
	'success' => 
	[
        'add' => '添加成功',
        'update' => '更新成功',
        'delete' => '删除成功',
        'set' => '操作成功',
		'schedule_update' => '状态更新成功',
        'staffleave_create' => '请假创建成功',
        'staffleave_delete' => '删除成功'
	],
	'code' =>
    [

        '10001' => '小区不能为空',
        '10002' => '有不存在的小区',
        '10003' => '操作失败',
        '10004' => '服务范围错误',
        '10005' => '地图坐标错误',
        '10006' => '服务人员不能为空',
        '10007' => '信息已存在，请勿重复添加',

        '10101' => '手机号码不能为空',
        '10102' => '手机号码不正确',
        '10103' => '验证码不能为空',
        '10104' => '验证码不正确',
        '10105' => '密码不能为空',
        '10106' => '密码错误，密码由5~20位的字符组成',
        '10107' => '注册失败，请稍候再试或者联系客服',
        '10108' => '手机号码未注册',
        '10109' => '登录密码错误',
        '20001' => '没有找到相关订单',
        '20002' => '订单状态不合法',
        '40001' => '状态不合法',
        '40002' => '小时列表不能为空',
        '40003' => '状态更新失败',
        '50001' => '这时间段里面有订单,不能请假',
        '50002' => '请选择请假开始时间',
        '50003' => '请选择请假结束时间',
        '50004' => '请输入请假事由',
        '50005' => '结束时间必须大于开始时间',
        '50006' => '这时间段里已有请假记录,不能请假',
        '50007' => '参数不合法',
        '50008' => '删除请假记录失败',
        '50301' => '员工编号为空',
        '50302' => '状态不合法',
        '50303' => '小时列表不能为空',
        '50304' => '状态更新失败',
        '50401' => '时间参数错误',
        '50402' => '存在已设置过的时间',
        '50403' => '服务时间设置失败',
        '50404' => '服务时间记录不存在',
        '50405' => '删除服务时间失败',
        '60001' => '头像不能为空',
        '60002' => '头像保存失败',
        '60003' => '相册保存失败',
        '60004' => '更新失败',
        '60005' => '地址不能为空',
        '60006' => '地图定位错误',
        '60007' => '服务范围错误',
        '60008' => '删除失败',

        '99996' => '需要登录才能调用此接口',
        '99997' => 'TOKEN错误',
        '99998' => '安全错误',
        '99999' => '程序处理错误',
	]
];
