<?php
return [
	'upload_image'  => '上传图片',
	'remove_image'  => '删除图片',
	'form_sumit' 	=> '提 交',
	'noId'		 	=> '未获取到编号,请刷新,重试！', 

	'orderStatus' => [
		'0' => '未处理',
		'1' => '会员取消订单',
		'2' => '支付超时取消订单',
		'3' => '卖家出发',
		'4' => '开始服务',
		'5' => '服务完成',
		'6' => '会员确认',
		'7' => '退款审核中',
		'8' => '退款处理中',
		'9' => '退款未通过',
		'10' => '退款成功',
		'11' => '会员已删除订单',
		'12' => '服务人员删除订单',
	],

	'payWay' => [
		'other' => '其他',
		'alipay' => '支付宝 支付',
		'alipayWap' => '支付宝 支付',
		'weixin' => '微信 支付',
		'weixinJs' => '微信 支付',
	],
	'payType' => [
		'other' => '其他',
		'alipay' => '支付宝',
		'alipayWap' => '支付宝',
		'weixin' => '微信',
		'weixinJs' => '微信',
	],
	'laiyuan' => [
		'order_pay' => '订单支付',
		'apply_withdraw' => '提现银行', 
		'order_confirm'=> '完成订单',
	],

    'status_money_logs' => [
        '0' => '待审核',
        '1' => '已通过',
        '2' => '已拒绝',
        '3' => '已确认',
        '4' => '已退款'
    ],
	'code' => [
		//98xxx 常规提示
		'98001'=>'添加成功',
		'98002'=>'添加失败',
		'98003'=>'修改成功',
		'98004'=>'修改失败',
		'98005'=>'删除成功',
		'98006'=>'删除失败',
		'98007'=>'非数字格式错误',
		'98008'=>'操作成功',
		'98009'=>'操作失败',
		'98010'=>'获取列表失败,请刷新重试',
		'98011'=>'获取信息失败,请刷新重试',
		'98012'=>'非法操作',
		'98013'=>'处理成功',
		'98014'=>'处理失败',
	],
];