<?php

return [
	'success' => [
		'user_login'				=> '登录成功',
		'update_success'			=> '更新成功',
	],

	//奖金
	'bonus'=>[
		'0'					=> '已拒绝',
		'1'					=> '首存',
		'2'					=> '再存',
		'3'					=> '现金回馈',
		'4'					=> '邀请朋友',
		'5'					=> '反水',
		// '6'					=> '手续费',
		'6'					=> '其他活动',
		'7'					=> '积分兑换',
	],

	'code' => [
		'10001'		=> '不存在此账户',
		'10002'		=> '此账户已被锁定',
		'10003'		=> '密码错误次数已达上限，帐号已经被锁定',
		'10004'		=> '帐号或密码错误',
		'10005'		=> '登录失败，请联系客服',
		'10006'		=> '账号不能为空',
		'10007'		=> '账号少于5位',
		'10008'		=> '账号大于20位',
		'10009'		=> '密码不能为空',
		'10010'		=> '密码少于6位',
		'10011'		=> '密码大于20位',

		'10101'		=> '请输入正确的原密码',
		'10102'		=> '新密码不能为空',
		'10103'		=> '两次输入的密码不一致',
		'10104'		=> '您要更改的邮箱已存在',
		'10105'		=> '您要更改的电话已存在',
		'10106'		=> '您要更改的QQ已存在',
		'10107'		=> '密码长度不足6位',
	]
];